// Всі функції повинні бути описані стрілочним типом!!!!
//     - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)

// let min = (num1, num2, num3) => {
//     if (num1 < num2 && num1 < num3){
//         console.log(num1);
//     }
//     else if (num2 < num3 && num2 < num1){
//         console.log(num2);
//     }
//     else{
//         console.log(num3);
//     }
// }
// min(1, 2, -3)

// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)

// let max = (num1, num2, num3) => {
//     if (num1 > num2 && num1 > num3){
//         console.log(num1);
//     }
//     else if (num2 > num3 && num2 > num1){
//         console.log(num2);
//     }
//     else{
//         console.log(num3);
//     }
// }
// max(1, 2, -3)

// - створити функцію яка повертає найбільше число з масиву

// const arr = [10, 2, 4, 22]
// let maxArray = (array) => {
//     let max = array[0]
//     for (const item of array) {
//         if (max < item) {
//             max = item;
//         }
//     }
//     return max
// }
// console.log(maxArray(arr));

// - створити функцію яка повертає найменьше число з масиву

// const arr = [10, 2, 4, 22]
// let minArray = (array) => {
//     let min = array[0]
//     for (const item of array) {
//         if (min > item) {
//             min = item;
//         }
//     }
//     return min
// }
// console.log(minArray(arr));

// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13

// let sum = 0;
// let count = (arr) => {
//     for (i = 0; i < arr.length; i++) {
//         sum += arr[i];
//     }
//     console.log(sum);
// }
// count([25, 40, 77, 53])

// - Дано натуральное число n. Выведите все числа от 1 до n.

// let my_function = (n) => {
//     return n <= 1? 1 : my_function(n - 1) + ' ' + n;
// }
// console.log(my_function(11));

// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.


// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
//
// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]
